#include<iostream>

int main08() {

	/*水仙花数是指一个 3 位数，它的每个位上的数字的 3次幂之和等于它本身
	例如：1 ^ 3 + 5 ^ 3 + 3 ^ 3 = 153*/

	// 利用do...while语句，求出所有3位数中的水仙花数

	// 1、将所有的三位数输出 100~999
	int num = 100;
	do {
		// 2、在所有三位数中找到水仙花数

		/*
		水仙花数 153
		获取个位 153%10=3
		获取十位 153/10=15 15%10=5
		获取百位 153/100=1
		*/

		int a, b, c = 0;	// 个十百位
		a = num % 10;
		b = num / 10 % 10;
		c = num / 100;
		if (num == a * a * a + b * b * b + c * c * c) {
			std::cout << num << std::endl;
		}
		num++;
	} while (num < 1000);
	return 0;
}