#include<iostream>

int main06() {
	//定义方式1
	//数据类型  数组名[行数][列数];
	int arr[2][3];
	arr[0][0] = 1; 
	arr[0][1] = 2;
	arr[0][2] = 3;
	arr[1][0] = 4;
	arr[1][1] = 5;
	arr[1][2] = 6;
	for (int i = 0; i < 2; i++) {
		for (int j = 0; j < 3; j++) {
			std::cout << arr[i][j] << " ";
		}
		std::cout << std::endl;
	}

	//定义方式2 优先选择
	//数据类型  数组名[行数][列数] = { {数据1，数据2 } ，{数据3，数据4 } };
	int arr2[2][3] = {
		{1,2,3},
		{4,5,6}
	};

	//定义方式3
	//数据类型  数组名[行数][列数] = { 数据1，数据2，数据3，数据4 };
	int arr3[2][3] = { 1,2,3,4,5,6 };

	//定义方式4
	//数据类型  数组名[][列数] = { 数据1，数据2，数据3，数据4 }; 
	//在定义二维数组时，如果初始化了数据，可以省略行数
	int arr4[][3] = { 1,2,3,4,5,6 };

	return 0;
}